Revit 2027 API
BuiltInFailures.DesignOptionFailures.KingNeverInOptionWarn Property
 A selected "[Serf]" belongs to a "[King]" which cannot be added to an Option--it was not added to the Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId KingNeverInOptionWarn { get; }
Public Shared ReadOnly Property KingNeverInOptionWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ KingNeverInOptionWarn {
	FailureDefinitionId^ get ();
}
static member KingNeverInOptionWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace